/********************************************************************
*	模块名称 : 蜂鸣器
*	文件名称 : Buzzer.c
*	版    本 : V1.0
*	说    明 : 
*********************************************************************/
#include "config.h"
#include "Buzzer.h"
#include "WR_Android.h"
#include "KEY.h"
/*********************************************************************/
bit ubToneOn=0;
bit ubLongToneOn=0;

/********************************************************************
*功能说明: 初始化定时器T1，定时125uS，用于时钟输出驱动蜂鸣器
*形    参: 
*返 回 值: 
/********************************************************************/
void Timer1_init( void )		
{
    AUXR |= 0x40;   // 定时器时钟1T模式
    TMOD &= 0x0F;		// 设置定时器模式
    TL1 = 0x48;			// 设置定时初值   125us
    TH1 = 0xF4;			// 设置定时初值
//		TL1 = 0xA0;			//设置定时初始值   100us
//		TH1 = 0xF6;			//设置定时初始值
    TF1 = 0;				// 清除TF1标志
    ET1 = 0;        // 禁止中断
    TR1 = 1;        // 开启定时器
}

/********************************************************************
*功能说明: 蜂鸣器程序
*形    参: 
*返 回 值: 
/********************************************************************/
void Task_Buzzer(void)
{
	static uint8_t ToneTemp =0;
	static uint8_t ErrToneTime = 0;   		//系统错误鸣叫一声时间
	
	if(ucError)								//故障一直叫
	{
		if(++ErrToneTime >=200)
		{
			ErrToneTime=0;
			Tone;
		}
	}

	if(ubToneOn)								//短声音=20
	{
		ubToneOn =0; 
		ToneTemp =20;
		BUZ_PIN_ACTIVE;						//打开时钟输出
	}
	else if(ubLongToneOn)					//长声音=80
	{
		ubLongToneOn=0; 
		ToneTemp=80;						
		BUZ_PIN_ACTIVE;						//打开时钟输出
	}

	if((ToneTemp))
	{
		ToneTemp--; 
	}
	else
	{
		BUZ_PIN_FREEZE;						//关闭时钟输出
	}
}

